SpenceKonde/ATTinyCore/tiny/boards.txt
attiny84.bootloader.low_fuses=0xE2
attiny84.bootloader.high_fuses=0xD7
attiny84.bootloader.extended_fuses=0xFE
attiny84.bootloader.path=optiboot
attiny84.bootloader.file=optiboot_attiny84.hex

attiny84.build.mcu=attiny84
attiny84.build.f_cpu=8000000L
attiny84.build.core=tiny
attiny84.build.variant=tinyX4optiboot
 
###########################################################################

attiny84nr.name=Optiboot ATtiny84 @ 8 MHz  (NO RESET!)

attiny84nr.upload.protocol=arduino
attiny84nr.upload.speed=19200
#bootloader takes up last 9 pages, so there is a limit on the max size.
attiny84nr.upload.maximum_size=7616

attiny84nr.bootloader.low_fuses=0xE2
attiny84nr.bootloader.high_fuses=0x57
attiny84nr.bootloader.extended_fuses=0xFE
attiny84nr.bootloader.path=optiboot
attiny84nr.bootloader.file=optiboot_attiny84.hex

attiny84nr.build.mcu=attiny84
attiny84nr.build.f_cpu=8000000L
attiny84nr.build.core=tiny
attiny84nr.build.variant=tinyX4optiboot
 
###########################################################################

attiny85.name=Optiboot ATtiny85 @ 8 MHz  (internal osc)

attiny85.upload.protocol=arduino
attiny85.upload.speed=19200
#bootloader takes up last 9 pages, so there is a limit on the max size.
attiny85.upload.maximum_size=7616

attiny85.bootloader.low_fuses=0xE2
attiny85.bootloader.high_fuses=0xD7
attiny85.bootloader.extended_fuses=0xFE
attiny85.bootloader.path=optiboot
attiny85.bootloader.file=optiboot_attiny85.hex

attiny85.build.mcu=attiny85
attiny85.build.f_cpu=8000000L
attiny85.build.core=tiny
attiny85.build.variant=tinyX5optiboot
 
###########################################################################

attiny88_1MHz.name=attiny88 @ 1 MHz  (internal oscillator; BOD enabled)
attiny88_1MHz.upload.using=arduino:arduinoisp
attiny88_1MHz.upload.maximum_size=8192
attiny88_1MHz.upload.protocol=arduino
attiny88_1MHz.upload.speed=19200

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms; [CKSEL=1110 SUT=10]; default value
# Divide clock by 8 internally; [CKDIV8=0]
attiny88_1MHz.bootloader.low_fuses=0x6E

# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]
# Serial program downloading (SPI) enabled; [SPIEN=0]
attiny88_1MHz.bootloader.high_fuses=0xD7

# Self-Programming Disabled; [SELFPRGEN=1]
attiny88_1MHz.bootloader.extended_fuses=0x06

attiny88_1MHz.bootloader.path=
attiny88_1MHz.bootloader.file=
attiny88_1MHz.build.mcu=attiny88
attiny88_1MHz.build.f_cpu=1000000L
attiny88_1MHz.build.core=tinyNoMillis
# standard arduino core also compiles: 
#attiny88_1MHz.build.core=arduino
attiny88_1MHz.build.variant=tinyX8

###########################################################################

attiny88_8MHz.name=attiny88 @ 8 MHz  (internal oscillator; BOD enabled)
attiny88_8MHz.upload.using=arduino:arduinoisp
attiny88_8MHz.upload.maximum_size=8192
attiny88_8MHz.upload.protocol=arduino
attiny88_8MHz.upload.speed=19200

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms; [CKSEL=1110 SUT=10]; default value
# Divide clock by 8 internally; [CKDIV8=0]
attiny88_8MHz.bootloader.low_fuses=0xEE

# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]
# Serial program downloading (SPI) enabled; [SPIEN=0]
attiny88_8MHz.bootloader.high_fuses=0xD7

# Self-Programming Disabled; [SELFPRGEN=1]
attiny88_8MHz.bootloader.extended_fuses=0x06

attiny88_8MHz.bootloader.path=
attiny88_8MHz.bootloader.file=
attiny88_8MHz.build.mcu=attiny88
attiny88_8MHz.build.f_cpu=8000000L
attiny88_8MHz.build.core=tinyNoMillis
# standard arduino core also compiles: 
#attiny88_8MHz.build.core=arduino
attiny88_8MHz.build.variant=tinyX8

###########################################################################
